# Задайте список из n чисел последовательности (1+1/n)**n и выведите на экран их сумму.
# Пример: Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}

n = int(input("введите число "))
f = lambda x: round((1+1/x)**x, 2)
result_list = [(i, f(i)) for i in range(1, n+1)]
print(result_list)